#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипКонтрагента.Клиент") Тогда
		Элементы.Наименование.Заголовок = "Ф.И.О. клиента";
		Элементы.ДатаРожденияКлиента.Видимость = Истина;
		Элементы.Пол.Видимость = Истина;
		Элементы.Источник.Видимость = Истина;
		Элементы.Договор.Видимость = Ложь;
		Элементы.Питомцы.Видимость = Истина;
	Иначе
		Элементы.Наименование.Заголовок = "Поставщик";
		Элементы.ДатаРожденияКлиента.Видимость = Ложь;
		Элементы.Пол.Видимость = Ложь;
		Элементы.Источник.Видимость = Ложь;
		Элементы.Договор.Видимость = Истина;
		Элементы.Питомцы.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти