#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БизнесПроцесс = Параметры.БизнесПроцесс;
	ОбновитьКартуМаршрутаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьКартуМаршрута(Команда)
	ОбновитьКартуМаршрутаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьКартуМаршрутаНаСервере()
	КартаМаршрута = ЭтаФорма.БизнесПроцесс.ПолучитьОбъект().ПолучитьКартуМаршрута();
КонецПроцедуры

#КонецОбласти