#Область СлужебныеПроцедурыИФункции

Функция ПроверитьОказаниеУслуг(ДокументЗаписьКлиента) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументЗаписьКлиента);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.Основание = &Ссылка
	|	И РеализацияТоваровИУслуг.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслуг.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();;
	Выборка.Следующий();
	ДокументРТУ = Выборка.Ссылка;
	
	Возврат ДокументРТУ;
КонецФункции

#КонецОбласти