#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПремияПродажи(Команда)
	ПремияПродажиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПремияПродажиНаСервере()
	Объект.Начисления.Очистить();
	
	НачалоПериода = НачалоМесяца(Объект.ПериодНачисления);
	КонецПериода = КонецМесяца(Объект.ПериодНачисления);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.Сотрудник КАК Сотрудник,
	|	ПродажиОбороты.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ПродажиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Начисления.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ВидРасчета = ПланыВидовРасчета.Начисления.НайтиПоНаименованию("Премия процентом от продаж");
		НоваяСтрока.ПоказательРасчета = Выборка.СуммаОборот;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
